[
  {
    "title": "QuickFlick.ai",
    "featuredImage": "/project_images/quickflick1.png",
    "images": [
      "/project_images/quickflick1.png",
      "/project_images/quickflick4.png",
      "/project_images/quickflick2.png",
      "/project_images/quickflick3.png"
    ],
    "description": "Quickflick is an AI-powered video creation and editing platform designed to make video production fast and accessible for everyone.\n\nI worked on this project for two years as the lead front-end developer and UI/UX designer, collaborating closely with the product owner and CEO.\n\nOur mission was to simplify the entire video creation process. We constantly explored new ways to reduce complexity, guided by the question: “Can my grandmother do this?” The platform integrates AI to assist with script generation, voice-overs, and selecting relevant media for each scene.\n\nMy work included designing and implementing the UI for all areas of the platform, building user flows, interaction patterns, and layouts from concept to code. I also created advertising and promotional material, drawing on my background in motion graphics and filmmaking.\n\nIn addition, I helped develop a robust internal admin environment where we controlled the AI pipeline, using custom prompts, adjustable model settings, and workflow checkpoints to manage how different AI models contributed to the final video output.",
    "technologies": ["Vanilla Javascript", "PHP", "CSS", "HTML"],
    "roles": ["Front-End Dev", "UI/UX Design"],
    "aspectRatio": "hero",
    "links": [
      {
        "title": "quickflick.ai",
        "url": "https://quickflick.ai/"
      }
    ]
  },
  {
    "title": "Boginn Archery Website",
    "featuredImage": "/project_images/boginn1.avif",
    "images": [
      "/project_images/boginn2.avif",
      "/project_images/boginn3.avif",
      "/project_images/boginn4.avif",
      "/project_images/boginn5.avif"
    ],
    "description": "I designed and developed a new website for Boginn Archery, the largest archery club in Iceland and one of the biggest in the Nordic region.\n\nThe main goal was to build a modern website with a strong visual identity, fast performance, and clear navigation, while keeping operational costs as low as possible. The site needed to allow visitors to easily find schedules, membership information, and upcoming events.\n\nThe previous website ran on WordPress, which limited both performance and design freedom. To meet the club’s needs, I selected tools that balanced flexibility with ease of use for non-technical staff. The website was built in Astro, giving full creative control over layout, design, and frontend structure.\n\nThe structure and page layout were planned to reduce information overload and make frequently accessed content accessible within one or two clicks. The goal was to make the interface feel simple, predictable, and supportive for both new visitors and long-term club members.\n\nTo enable staff to update content independently, I integrated DecapBridge (an open-source authentication and content management workflow), which allows secure login and simple content editing without touching code. This setup gives the club long-term scalability while keeping running costs close to zero.\n\nThe new website is now used daily by members, coaches, and parents. It has improved the accessibility of information and reduced the number of direct support questions received by the club, while giving staff far more control over their online presence.",
    "technologies": [
      "Astro",
      "DecapBridge",
      "Netlify (Hosting)",
      "Uploadcare (Asset Management)",
      "Umami (Analytics)",
      "Migadu (Email Hosting)"
    ],
    "roles": ["Full Stack", "UI/UX Design"],
    "aspectRatio": "tall",
    "links": [
      {
        "title": "boginn.is",
        "url": "https://boginn.is/"
      }
    ]
  },
  {
    "title": "Vörn App",
    "featuredImage": "/project_images/vorn1.avif",
    "images": [
      "/project_images/vorn5.png",
      "/project_images/vorn6.png",
      "/project_images/vorn7.png",
      "/project_images/vorn1.avif"
    ],
    "description": "Vörn was my bachelor’s capstone project at Reykjavík University, developed in collaboration with the Department of Fire Safety in Iceland. Our team of three redesigned their building inspection application, which is used to assess and document whether buildings meet fire safety standards.\n\nAn in-house application had already been in use for more than a decade, and while it was functionally reliable, it had clear usability and structural limitations. Our goal was to analyse the existing app, understand how inspectors used it in real operational environments, and redesign the experience to improve efficiency, clarity, and navigation.\n\nWe carried out user surveys, workflow mapping, and usability testing to identify what the current system did well and where it fell short. From this research, we produced a new prototype and interaction flow that followed modern mobile practices and reduced unnecessary steps. The images shown first are from the prototype, outlining the improved structure and updated visual direction.\n\nA key design requirement was reducing the possibility of user error. Fire inspections often happen in distracting environments, where inspectors are moving between rooms, speaking with personnel, and handling equipment. The app therefore needed to be fast to operate with minimal cognitive load, helping inspectors stay focused on safety rather than interface management.\n\nMy main role on the team was bridging design and development. I led the development of the new interaction flow and layout structure, working closely with feedback from inspectors and stakeholders. I also set up and structured the codebase in .NET MAUI, a relatively new native framework, allowing the other team members to focus on visual refinements, backend integration, and user management.",
    "technologies": [".NET MAUI", "Azure DevOps"],
    "roles": ["Native Development", "Prototype Design", "UX Design"],
    "aspectRatio": "",
    "links": [
      {
        "title": "Thesis Webpage",
        "url": "https://hdl.handle.net/1946/50442"
      }
    ]
  },
  {
    "title": "Hvar er Best að vera?",
    "featuredImage": "/project_images/hvarerbest1.png",
    "images": [
      "/project_images/hvarerbest2.png",
      "/project_images/hvarerbest1.png",
      "/project_images/hvarerbest3.png"
    ],
    "description": "In Iceland, weather changes quickly from region to region, and people often try to “chase” the best conditions during summer. The goal of this project was to visualise exactly where in the country the weather would be most enjoyable at any given time. The name of the project translates to “Where Is Best To Be?”\n\nThe website connects to the public Icelandic Meteorological Office API, collecting forecast data from around 200 weather stations across the country. These forecasts are processed through a custom scoring system that ranks the locations based on user-selected weather preferences. For example, visitors can prioritise temperature over wind, or adjust other factors to create their own ranking model.\n\nThe system then displays the top-ranked location—highlighting it directly on the map—and also presents the second and third best locations as alternative options. The experience is designed to give a quick, visual answer to the question: “Where should I go today?”\n\nAfter the core functionality was complete, I expanded the project by mapping camping sites, golf courses, and swimming pools near the top-ranked stations. These are some of the most popular outdoor activities in Iceland, and the feature allows users to immediately see what they can do if they decide to travel to that location.\n\nFrom a technical perspective, the project was built to remain efficient and inexpensive to run. A custom Iceland overlay was designed using Mapbox, and the platform is hosted on Firebase. Weather data is stored locally in a managed database and refreshed once per day, rather than requesting live data on each page load, which improves performance and reduces unnecessary API usage.",
    "technologies": ["React", "Firebase", "Render (DB)"],
    "roles": ["Full-Stack Dev", "UI/UX Design"],
    "aspectRatio": "",
    "links": [
      {
        "title": "hvarerbestadvera.is",
        "url": "https://hvarerbestadvera.is/"
      }
    ]
  },
  {
    "title": "Archery Broadcast Graphics Engine",
    "featuredImage": "/project_images/archeryscoring2.png",
    "images": [
      "/project_images/archeryscoring1.png",
      "/project_images/archeryscoring5.png",
      "/project_images/archeryscoring2.png",
      "/project_images/archeryscoring3.png",
      "/project_images/archeryscoring4.png"
    ],
    "description": "For the past six years, I have been responsible for running the live streams for Iceland’s national archery competitions, which take place four times per year. The original graphic package we used came from the World Archery Federation, allowing us to broadcast with professional visual standards. However, that setup required a big desktop tower (and had to be on Windows) to run both the graphics system and the stream simultaneously, which made the workflow restrictive and difficult to move between venues.\n\nMy goal was to modernise this system by designing new competition graphics and creating a lightweight, cross-platform engine to run them directly on the streaming computer. The software is built with Electron, using Chromium for rendering, and the graphics themselves are written in React—essentially standard web UI components. This approach makes the system extremely efficient and easy to run on almost any machine, while integrating seamlessly with OBS through a simple browser source.\n\nI also focused heavily on usability. Live production often happens under pressure, and competitions are sometimes streamed from a 13-inch laptop. Because of this, interface layout and screen real estate were a priority. I designed a compact control panel that keeps essential controls visible at all times without blocking the production workspace.\n\nIn addition to developing the software, I designed the broadcast graphics package. The visual direction was inspired by the World Archery federation’s TV broadcasts—clean and minimal to begin with, with plans to expand the design language and colour use in future iterations.\n\nOverall, this project allowed me to combine interface design, engineering, and live production experience to solve a real operational challenge and make streaming setup significantly easier and more flexible.",
    "technologies": ["Electron", "React"],
    "roles": ["Graphic Design", "Full-Stack Dev"],
    "aspectRatio": "",
    "links": [
      {
        "title": "Archery TV Iceland Youtube",
        "url": "https://www.youtube.com/@ArcheryTVIceland"
      }
    ]
  }
]
